[{"name":"Nicole-Reine Lepaute","url":"https://en.wikipedia.org/wiki/Nicole-Reine_Lepaute","year":1758,"fields":"Astronomer, mathematician","shortSummary":"Predicted the return of Halley's Comet by calculating the timing of a solar eclipse","summary":"Nicole-Reine Lepaute (née Étable de la Briere; also known as Hartense Lepaute or Hortense Lepaute), (5 January 1723 – 6 December 1788) was a French astronomer and mathematician. Lepaute predicted the return of Halley's Comet by calculating the timing of a solar eclipse and constructing a group of catalogs for the stars. \nThe asteroid 7720 Lepaute is named in her honour, as is the lunar crater Lepaute. She was also a member of the Scientific Academy of Béziers.","backlinks":61},{"name":"Ada Lovelace","url":"https://en.wikipedia.org/wiki/Ada_Lovelace","year":1840,"fields":"Mathematician, writer","shortSummary":"First person to publish an algorithm intended for the first modern computer.","summary":"Augusta Ada King, Countess of Lovelace (née Byron; 10 December 1815 – 27 November 1852) was an English mathematician and writer, chiefly known for her work on Charles Babbage's proposed mechanical general-purpose computer, the Analytical Engine. She was the first to recognise that the machine had applications beyond pure calculation, and published the first algorithm intended to be carried out by such a machine. As a result, she is sometimes regarded as the first to recognise the full potential of a \"computing machine\" and one of the first computer programmers.Lovelace was the only legitimate child of poet Lord Byron and his wife Lady Byron. All of Byron's other children were born out of wedlock to other women. Byron separated from his wife a month after Ada was born and left England forever four months later. He commemorated the parting in a poem that begins, \"Is thy face like thy mother's my fair child! ADA! sole daughter of my house and heart?\". He died of disease in the Greek War of Independence when Ada was eight years old. Her mother remained bitter and promoted Ada's interest in mathematics and logic in an effort to prevent her from developing her father's perceived insanity. Despite this, Ada remained interested in Byron. Upon her eventual death, she was buried next to him at her request. Although often ill in her childhood, Ada pursued her studies assiduously. She married William King in 1835. King was made Earl of Lovelace in 1838, Ada thereby becoming Countess of Lovelace.\nHer educational and social exploits brought her into contact with scientists such as Andrew Crosse, Charles Babbage, Sir David Brewster, Charles Wheatstone, Michael Faraday and the author Charles Dickens, contacts which she used to further her education. Ada described her approach as \"poetical science\" and herself as an \"Analyst (& Metaphysician)\".When she was a teenager, her mathematical talents led her to a long working relationship and friendship with fellow British mathematician Charles Babbage, who is known as \"the father of computers\". She was in particular interested in Babbage's work on the Analytical Engine. Lovelace first met him in June 1833, through their mutual friend, and her private tutor, Mary Somerville.\nBetween 1842 and 1843, Ada translated an article by Italian military engineer Luigi Menabrea on the calculating engine, supplementing it with an elaborate set of notes, simply called Notes. These notes contain what many consider to be the first computer program—that is, an algorithm designed to be carried out by a machine. Other historians reject this perspective and point out that Babbage's personal notes from the years 1836/1837 contain the first programs for the engine. Lovelace's notes are important in the early history of computers. She also developed a vision of the capability of computers to go beyond mere calculating or number-crunching, while many others, including Babbage himself, focused only on those capabilities. Her mindset of \"poetical science\" led her to ask questions about the Analytical Engine (as shown in her notes) examining how individuals and society relate to technology as a collaborative tool.She died of uterine cancer in 1852 at the age of 36.","backlinks":1323},{"name":"Adele Goldstine","url":"https://en.wikipedia.org/wiki/Adele_Goldstine","year":1944,"fields":"Mathmatician, computer programmer","shortSummary":"Wrote the manual for the first electronic digital computer, ENIAC.","summary":"Adele Goldstine (née Katz; December 21, 1920 – November, 1964) was an American mathematician and computer programmer. She wrote the manual for the first electronic digital computer, ENIAC. Through her work programming the computer, she was also an instrumental player in converting the ENIAC from a computer that needed to be reprogrammed each time it was used to one that was able to perform a set of fifty stored instructions.","backlinks":246},{"name":"Barbara Paulson","url":"https://en.wikipedia.org/wiki/Barbara_Paulson","year":1948,"fields":"Human computer","shortSummary":"One of the first women scientists at NASA's JPL, calculated rocket trajectories by hand.","summary":"Barbara Jean Paulson (née Lewis, born April 11, 1928) is an American former human computer at NASA's Jet Propulsion Laboratory (JPL) and one of the first women scientists employed there. Paulson began working as a mathematician at JPL in 1948, where she calculated rocket trajectories by hand. She is among the women who made early progress at JPL.","backlinks":17},{"name":"Kathleen Booth","url":"https://en.wikipedia.org/wiki/Kathleen_Booth","year":1949,"fields":"Computer scientist","shortSummary":"Invented the first assembly language.","summary":"Kathleen Booth (born 1922) wrote the first assembly language and designed the assembler and autocode for the first computer systems at Birkbeck College, University of London. She helped design three different machines including the ARC (Automatic Relay Calculator), SEC (Simple Electronic Computer), and APE(X)C.\n\n","backlinks":39},{"name":"Katherine Johnson","url":"https://en.wikipedia.org/wiki/Katherine_Johnson","year":1958,"fields":"Mathematician","shortSummary":"Calculated trajectories, launch windows and emergency return paths critical to the success of the first and subsequent U.S. crewed spaceflights.","summary":"Katherine Coleman Goble Johnson (born August 26, 1918) is an American mathematician whose calculations of orbital mechanics as a NASA employee were critical to the success of the first and subsequent U.S. crewed spaceflights. During her 35-year career at NASA and its predecessor, the National Advisory Committee for Aeronautics, she earned a reputation for mastering complex manual calculations and helped pioneer the use of computers to perform the tasks. The space agency noted her \"historical role as one of the first African-American women to work as a NASA scientist\".Johnson's work included calculating trajectories, launch windows and emergency return paths for Project Mercury spaceflights, including those for astronauts Alan Shepard, the first American in space, and John Glenn, the first American in orbit, and rendezvous paths for the Apollo Lunar Module and command module on flights to the Moon. Her calculations were also essential to  the beginning of the Space Shuttle program, and she worked on plans for a mission to Mars. In 2015, President Barack Obama awarded Johnson the Presidential Medal of Freedom.  She was portrayed by Taraji P. Henson as a lead character in the 2016 film Hidden Figures.\nIn 2019, Johnson was awarded the Congressional Gold Medal.","backlinks":484},{"name":"Margaret Hamilton (scientist)","url":"https://en.wikipedia.org/wiki/Margaret_Hamilton_(software_engineer)","year":1965,"fields":"Computer scientist, systems engineer, business owner","shortSummary":"Programmed the onboard flight software for NASA's Apollo Moon mission computers.","summary":"Margaret Heafield Hamilton (born August 17, 1936) is an American computer scientist, systems engineer and business owner. She was director of the Software Engineering Division of the MIT Instrumentation Laboratory, which developed on-board flight software for NASA's Apollo space program. She later founded two software companies—Higher Order Software in 1976 and Hamilton Technologies in 1986, both in Cambridge, Massachusetts.\nHamilton has published more than 130 papers, proceedings and reports about sixty projects and six major programs. She is one of the people credited with coining the term \"software engineering\".On November 22, 2016, Hamilton received the Presidential Medal of Freedom from President Barack Obama for her work leading to the development of on-board flight software for NASA's Apollo Moon missions.\n\n","backlinks":104},{"name":"Erna Schneider Hoover","url":"https://en.wikipedia.org/wiki/Erna_Schneider_Hoover","year":1971,"fields":"Mathematician","shortSummary":"Invented a computerized telephone switching method that replaced switchboards and \"revolutionized modern communication\".","summary":"Dr. Erna Schneider Hoover (born June 19, 1926) is an American mathematician notable for inventing a computerized telephone switching method which \"revolutionized modern communication\" according to several reports. It prevented system overloads by monitoring call center traffic and prioritizing tasks on phone switching systems to enable more robust service during peak calling times. At Bell Laboratories where she worked for over 32 years, Hoover was described as an important pioneer for women in the field of computer technology.","backlinks":1145},{"name":"Jude Milhon","url":"https://en.wikipedia.org/wiki/Jude_Milhon","year":1973,"fields":"Hacker, author","shortSummary":"Coined the term cypherpunk and maintained Community Memory, the first public computerized bulletin board system.","summary":"Judith [Jude] Milhon (March 12, 1939 – July 19, 2003), in Washington D.C., best known by her pseudonym St. Jude, was a hacker and author in the San Francisco Bay Area.\nMilhon coined the term cypherpunk and was a founding member of the cypherpunks. On July 19, 2003, Milhon died of cancer.","backlinks":28},{"name":"Carol Shaw","url":"https://en.wikipedia.org/wiki/Carol_Shaw","year":1980,"fields":"Video game designer and programmer","shortSummary":"Considered to the first modern female games designer, released a 3D version of tic-tac-toe for the Atari 2600.","summary":"Carol Shaw (born 1955) was one of the first female game designers and programmers in the video game industry. She is best known for creating the Atari 2600 vertically scrolling shooter River Raid (1982) for Activision. She worked for Atari, Inc. from 1978-1980 where she designed multiple games including 3-D Tic-Tac-Toe (1978) and Video Checkers (1980), both for the Atari 2600. She left game development in 1984 and retired in 1990.","backlinks":16},{"name":"Roberta Williams","url":"https://en.wikipedia.org/wiki/Roberta_Williams","year":1980,"fields":"Video game designer, writer, co-founder","shortSummary":"Pioneered the graphic adventure game format in Mystery House and the King's Quest series.","summary":"Roberta Williams (born February 16, 1953) is an American video game designer, writer, and a co-founder of Sierra On-Line (later known as Sierra Entertainment), who developed her first game while living in Simi Valley, California. She is most famous for her work in the field of graphic adventure games with titles such as Mystery House, the King's Quest series, and Phantasmagoria. She is married to Ken Williams and retired in 1999. Roberta Williams is one of the most influential PC game designers of the 1980s and 1990s, and has been credited with creating the graphic adventure genre.","backlinks":194},{"name":"Susan Kare","url":"https://en.wikipedia.org/wiki/Susan_Kare","year":1984,"fields":"Artist, graphic designer","shortSummary":"Designed the original icons for the Macintosh, including the moving watch, paintbrush and trash can.","summary":"Susan Kare (; born February 5, 1954) is an artist and graphic designer best known for her interface elements and typeface contributions to the first Apple Macintosh in the 1980s. She was also Creative Director (and one of the original employees) at NeXT, the company formed by Steve Jobs after he left Apple in 1985 and has since contributed at Microsoft, IBM, Facebook, and Pinterest. She has worked for Microsoft, IBM, Pinterest and Facebook.","backlinks":153},{"name":"Radia Perlman","url":"https://en.wikipedia.org/wiki/Radia_Perlman","year":1985,"fields":"Computer programmer, network engineer","shortSummary":"Came up with a way to route information packets in an \"infinitely scalable\" way that allowed large networks like the Internet to function.","summary":"Radia Joy Perlman (born 1951) is an American computer programmer and network engineer. She is most famous for her invention of the spanning-tree protocol (STP), which is fundamental to the operation of network bridges, while working for Digital Equipment Corporation. She also made large contributions to many other areas of network design and standardization, such as link-state routing protocols.\nMore recently she has invented the TRILL protocol to correct some of the shortcomings of spanning-trees. She is currently employed by Dell EMC.","backlinks":1242},{"name":"Jaime Levy","url":"https://en.wikipedia.org/wiki/Jaime_Levy","year":1990,"fields":"Author, lecturer, interace designer, user experience strategist","shortSummary":"Created one of the first e-Zines, CyberRag, which included articles, games and animations loaded onto diskettes.","summary":"Jaime Levy is an American author, lecturer, interface designer, and user experience strategist. She first became known for her new media projects in the 1990s. Her best-known projects include the floppy disk distributed with Billy Idol’s album Cyberpunk, WORD, an online magazine, and an online cartoon series, CyberSlacker.","backlinks":19},{"name":"Nancy Hafkin","url":"https://en.wikipedia.org/wiki/Nancy_Hafkin","year":1990,"fields":"","shortSummary":"Worked on networking and enabling email connections in 10 African countries.","summary":"Nancy Hafkin is a pioneer of networking and development information and electronic communications in Africa, spurring the Pan African Development Information System (PADIS) of the United Nations Economic Commission for Africa (UNECA) from 1987 until 1997. Nancy Hafkin played a role in facilitating the Association for Progressive Communications's work to enable email connectivity in more than 10 countries during the early 1990s, before full Internet connectivity became a reality in most of Africa. The APC (headquarters in Johannesburg) established the annual Nancy Hafkin Prize for innovation in information technology in Africa which recognises outstanding initiatives using information and communications technology (ICTs) for development.","backlinks":87},{"name":"Hu Qiheng","url":"https://en.wikipedia.org/wiki/Hu_Qiheng","year":1994,"fields":"Computer scientist","shortSummary":"Leader of the team who installed the first TCP/IP connection for China","summary":"Hu Qiheng (born 1934) is a Chinese computer scientist. Hu was the vice president of the Chinese Academy of Sciences from 1987 to 1996 and led the National Computing and Networking Facility of China which connected China to the Internet in April 1994. Hu was inducted into the Internet Hall of Fame in 2013 as a global connector.","backlinks":86},{"name":"Lucy Sanders","url":"https://en.wikipedia.org/wiki/Lucy_Sanders","year":2004,"fields":"CEO","shortSummary":"Founded the National Center for Women & Information Technology to address the gender gap in computing.","summary":"Lucinda \"Lucy\" Sanders (born 1954) is the current CEO and a co-founder of the National Center for Women & Information Technology. She is the recipient of many distinguished honors in the STEM fields, including induction into the US News STEM Leadership Hall of Fame  in 2013.","backlinks":19},{"name":"Coraline Ada Ehmke","url":"https://en.wikipedia.org/wiki/Coraline_Ada_Ehmke","year":2014,"fields":"Software developer, open source advocate","shortSummary":"Drafted the Contributor Covenant to bring inclusion to the world of open source project development.","summary":"Coraline Ada Ehmke is a software developer and open source advocate based in Chicago, Illinois. She began her career as a web developer in 1994 and has worked in a variety of industries, including engineering, consulting, education, advertising, healthcare, and software development infrastructure. She is known for her work in Ruby, and in 2016 earned the Ruby Hero award at RailsConf, a conference for Ruby on Rails developers. She is also known for her social justice work and activism, the creation of Contributor Covenant, and promoting the widespread adoption of codes of conduct for open source projects and communities.","backlinks":29},{"name":"Mary Lou Jepsen","url":"https://en.wikipedia.org/wiki/Mary_Lou_Jepsen","year":2005,"fields":"technical executive, inventor","shortSummary":"Prolific inventor in the fields of display, imaging, and computer hardware, and the co-founder and CTO of One Laptop Per Child","summary":"Mary Lou Jepsen (born 1965) is a technical executive and inventor in the fields of display, imaging, and computer hardware.  Her contributions have had worldwide adoption in head-mounted display, HDTV, laptop computers, and projector products; she was the technical force behind a generation of low-cost computing, and innovative consumer and medical imaging technologies. She was named one of the hundred most influential people in the world by Time Magazine (Time 100), was named in 2013 to CNN's top 10 thinkers in science and technology for her work in display innovation, and she has over 200 patents published or issued. \nShe was the co-founder and first chief technology officer of One Laptop per Child (OLPC), and later founded Pixel Qi in Taipei, Taiwan, focused on the design and manufacture of displays. She founded and led two moonshots at Google X, reporting to Sergey Brin, and was an executive at Facebook / Oculus VR, leading an effort to advance Virtual Reality.   \nIn 2016 she founded OpenWater, a startup working on fMRI-type imaging of the body using holographic, infrared techniques.","backlinks":49},{"name":"Grace Hopper","url":"https://en.wikipedia.org/wiki/Grace_Hopper","year":1949,"fields":"Computer scientist, United States Navy rear admiral","shortSummary":"First person to design a compiler for a programming language.","summary":"Grace Brewster Murray Hopper (née Murray December 9, 1906 – January 1, 1992) was an American computer scientist and United States Navy rear admiral. One of the first programmers of the Harvard Mark I computer, she was a pioneer of computer programming who invented one of the first linkers.  She popularized the idea of machine-independent programming languages, which led to the development of COBOL, an early high-level programming language still in use today.\nPrior to joining the Navy, Hopper earned a Ph.D. in mathematics from Yale University and was a professor of mathematics at Vassar College. Hopper attempted to enlist in the Navy during World War II but was rejected because she was 34 years old. She instead joined the Navy Reserves. Hopper began her computing career in 1944 when she worked on the Harvard Mark I team led by Howard H. Aiken. In 1949, she joined the Eckert–Mauchly Computer Corporation and was part of the team that developed the UNIVAC I computer.  At Eckert–Mauchly she began developing the compiler. She believed that a programming language based on English was possible.  Her compiler converted English terms into machine code understood by computers. By 1952, Hopper had finished her program linker (originally called a compiler), which was written for the A-0 System. During her wartime service, she co-authored three papers based on her work on the Harvard Mark 1.\nIn 1954, Eckert–Mauchly chose Hopper to lead their department for automatic programming, and she led the release of some of the first compiled languages like FLOW-MATIC. In 1959, she participated in the CODASYL consortium, which consulted Hopper to guide them in creating a machine-independent programming language. This led to the COBOL language, which was inspired by her idea of a language being based on English words. In 1966, she retired from the Naval Reserve, but in 1967 the Navy recalled her to active duty.  She retired from the Navy in 1986 and found work as a consultant for the Digital Equipment Corporation, sharing her computing experiences.\nThe U.S. Navy Arleigh Burke-class guided-missile destroyer USS Hopper was named for her, as was the Cray XE6 \"Hopper\" supercomputer at NERSC. During her lifetime, Hopper was awarded 40 honorary degrees from universities across the world. A college at Yale University was renamed in her honor.  In 1991, she received the National Medal of Technology. On November 22, 2016, she was posthumously awarded the Presidential Medal of Freedom by President Barack Obama.","backlinks":1257}]