[{"name":"Ada Lovelace","url":"https://en.wikipedia.org/wiki/Ada_Lovelace","summary":"Augusta Ada King, Countess of Lovelace was an English mathematician and writer, chiefly known for her work on Charles Babbage's proposed mechanical general-purpose computer, the Analytical Engine. ","isCertain":true},{"name":"Adele Goldberg (computer scientist)","url":"https://en.wikipedia.org/wiki/Adele_Goldberg_(computer_scientist)","summary":"Adele Goldberg is a computer scientist who participated in developing the programming language Smalltalk-80 and various concepts related to object-oriented programming while a researcher at the Xerox Palo Alto Research Center, in the 1970s.","isCertain":false},{"name":"Adele Goldstine","url":"https://en.wikipedia.org/wiki/Adele_Goldstine","summary":"Adele Goldstine was an American mathematician and computer programmer. She wrote the manual for the first electronic digital computer, ENIAC. ","isCertain":true},{"name":"Adele Mildred Koss","url":"https://en.wikipedia.org/wiki/Milly_Koss","summary":"Adele Mildred Koss, known as Milly Koss, was an American computing pioneer. The Association for Women in Computing awarded her an Ada Lovelace Award in 2000.\n","isCertain":true},{"name":"Alan Turing","url":"https://en.wikipedia.org/wiki/Alan_Turing","summary":"Alan Mathison Turing OBE FRS was an English mathematician, computer scientist, logician, cryptanalyst, philosopher and theoretical biologist. ","isCertain":false},{"name":"Anna Winlock","url":"https://en.wikipedia.org/wiki/Anna_Winlock","summary":"Anna Winlock was an American astronomer and human computer, one of the first members of female computer group known as \"the Harvard Computers.\" She made the most complete catalog of stars near the north and south poles of her era. She is also remembered for her calculations and studies of asteroids. In particular, she did calculations on 433 Eros and 475 Ocllo.","isCertain":true},{"name":"Annalee Newitz","url":"https://en.wikipedia.org/wiki/Annalee_Newitz","summary":"Annalee Newitz is an American journalist, editor, and author of both fiction and nonfiction. They have written for the periodicals Popular Science and Wired. ","isCertain":false},{"name":"Annie Jump Cannon","url":"https://en.wikipedia.org/wiki/Annie_Jump_Cannon","summary":"Annie Jump Cannon was an American astronomer whose cataloging work was instrumental in the development of contemporary stellar classification. With Edward C. ","isCertain":false},{"name":"Barbara Paulson","url":"https://en.wikipedia.org/wiki/Barbara_Paulson","summary":"Barbara Jean Paulson is an American former human computer at NASA's Jet Propulsion Laboratory and one of the first women scientists employed there. Paulson began working as a mathematician at JPL in 1948, where she calculated rocket trajectories by hand. She is among the women who made early progress at JPL.","isCertain":true},{"name":"Beatrice Mabel Cave-Browne-Cave","url":"https://en.wikipedia.org/wiki/Beatrice_Mabel_Cave-Browne-Cave","summary":"Beatrice Mabel Cave-Browne-Cave, MBE AFRAeS was an English mathematician who undertook pioneering work in the mathematics of aeronautics.","isCertain":false},{"name":"Beatrice Worsley","url":"https://en.wikipedia.org/wiki/Beatrice_Worsley","summary":"Beatrice \"Trixie\" Helen Worsley was the first female computer scientist in Canada. She received her Ph.D. degree from the University of Cambridge with Alan Turing and Douglas Hartree as advisers, the first Ph.D granted in what would today be known as computer science. ","isCertain":true},{"name":"CRA-W: Committee on the Status of Women in Computing Research","url":"https://en.wikipedia.org/wiki/Janice_E._Cuny","summary":"Janice E. Cuny, known as Jan, is an American computer scientist noted for leading efforts in broadening participation in computing. She is a past co-chair of CRA-W: Committee on the Status of Women in Computing Research from 1997-2000.","isCertain":true},{"name":"Charles Babbage","url":"https://en.wikipedia.org/wiki/Charles_Babbage","summary":"Charles Babbage KH FRS was an English polymath. A mathematician, philosopher, inventor and mechanical engineer, Babbage originated the concept of a digital programmable computer.\n","isCertain":false},{"name":"Coraline Ada Ehmke","url":"https://en.wikipedia.org/wiki/Coraline_Ada_Ehmke","summary":"Coraline Ada Ehmke is a software developer and open source advocate based in Chicago, Illinois. She began her career as a web developer in 1994 and has worked in a variety of industries, including engineering, consulting, education, advertising, healthcare, and software development infrastructure. ","isCertain":true},{"name":"Danielle George","url":"https://en.wikipedia.org/wiki/Danielle_George","summary":"Danielle Amanda George MBE is a Professor of Radio frequency engineering in the School of Electrical and Electronic Engineering and Associate Dean for Teaching and Learning at the University of Manchester in the UK.","isCertain":false},{"name":"Diane Kelly (computer scientist)","url":"https://en.wikipedia.org/wiki/Diane_Kelly_(computer_scientist)","summary":"Diane Kelly is an American Computer Scientist, notable for her work on the analysis of information seeking behaviours, and the development of experimental methods to support further research in the field. ","isCertain":true},{"name":"Dona Bailey","url":"https://en.wikipedia.org/wiki/Dona_Bailey","summary":"Dona Bailey is an American video game programmer and educator who, along with Ed Logg in 1981, created the arcade video game Centipede.","isCertain":false},{"name":"Donna Strickland","url":"https://en.wikipedia.org/wiki/Donna_Strickland","summary":"Donna Theo Strickland is a Canadian optical physicist and pioneer in the field of pulsed lasers. She was awarded the Nobel Prize in Physics in 2018, together with Gérard Mourou, for the invention of chirped pulse amplification. ","isCertain":true},{"name":"Edith Clarke","url":"https://en.wikipedia.org/wiki/Edith_Clarke","summary":"Edith Clarke was the first woman to be professionally employed as an electrical engineer in the United States, and the first female professor of electrical engineering in the country. ","isCertain":false},{"name":"Elizabeth J. Feinler","url":"https://en.wikipedia.org/wiki/Elizabeth_J._Feinler","summary":"Elizabeth Jocelyn \"Jake\" Feinler is an American information scientist. From 1972 until 1989 she was director of the Network Information Systems Center at the Stanford Research Institute. ","isCertain":true},{"name":"Ellen Spertus","url":"https://en.wikipedia.org/wiki/Ellen_Spertus","summary":"Ellen R. Spertus is Elinor Kilgore Snyder Professor of computer science at Mills College, Oakland, California, United States, and a former senior research scientist at Google.\nSpertus grew up in Glencoe, Illinois, where she attended New Trier High School. ","isCertain":true},{"name":"Erna Schneider Hoover","url":"https://en.wikipedia.org/wiki/Erna_Schneider_Hoover","summary":"Dr. Erna Schneider Hoover is an American mathematician notable for inventing a computerized telephone switching method which \"revolutionized modern communication\" according to several reports. ","isCertain":false},{"name":"Female entrepreneur","url":"https://en.wikipedia.org/wiki/Anusheh_Anadil","summary":"Anusheh Anadil is a Bangladeshi musician, artist, cultural activist, and social entrepreneur.\nThe band 'Bangla' was the first female lead band from Bangladesh that became iconic-ally popular in both Bangldesh and West Bengal, for their first album 'Kingkortobbobimuro'. ","isCertain":false},{"name":"Frances Spence","url":"https://en.wikipedia.org/wiki/Diana,_Princess_of_Wales","summary":"Diana, Princess of Wales, was a member of the British royal family. She was the first wife of Charles, Prince of Wales, and the mother of Prince William and Prince Harry. ","isCertain":true},{"name":"George Antheil","url":"https://en.wikipedia.org/wiki/George_Antheil","summary":"George Antheil was an American avant-garde composer, pianist, author, and inventor whose modernist musical compositions explored the modern sounds – musical, industrial, and mechanical – of the early 20th century.\n","isCertain":false},{"name":"Gwen Bell","url":"https://en.wikipedia.org/wiki/Gwen_Bell","summary":"Gwen Bell was the first president of The Computer Museum in Boston, which she co-founded with her husband Gordon Bell.","isCertain":true},{"name":"Harold Wilson","url":"https://en.wikipedia.org/wiki/Harold_Wilson","summary":"James Harold Wilson, Baron Wilson of Rievaulx, KG, OBE, PC, FRS, FSS was a British Labour politician who served as Prime Minister of the United Kingdom from 1964 to 1970 and 1974 to 1976.\n","isCertain":false},{"name":"Jaime Levy","url":"https://en.wikipedia.org/wiki/Jaime_Levy","summary":"Jaime Levy is an American author, lecturer, interface designer, and user experience strategist. She first became known for her new media projects in the 1990s. ","isCertain":true},{"name":"Jude Milhon","url":"https://en.wikipedia.org/wiki/Jude_Milhon","summary":"Judith [Jude] Milhon, in Washington D.C., best known by her pseudonym St. Jude, was a hacker and author in the San Francisco Bay Area.\nMilhon coined the term cypherpunk and was a founding member of the cypherpunks. On July 19, 2003, Milhon died of cancer.","isCertain":true},{"name":"Judy Clapp","url":"https://en.wikipedia.org/wiki/Judy_Clapp","summary":"Judith A. Clapp is a computer scientist who began her career at the Massachusetts Institute of Technology and subsequently moved to the Lincoln Laboratory and then to MITRE, where she was involved in the Semi-Automatic Ground Environment military project, including the development of the SAGE computer.","isCertain":true},{"name":"Kateryna Yushchenko (scientist)","url":"https://en.wikipedia.org/wiki/Kateryna_Yushchenko_(scientist)","summary":"Kateryna Lohvynivna Yushchenko was a Ukrainian computer and information research scientist, corresponding member of USSR Academy of Sciences, and member of The International Academy of Computer Science. ","isCertain":false},{"name":"Katherine Johnson","url":"https://en.wikipedia.org/wiki/Katherine_Johnson","summary":"Katherine Coleman Goble Johnson is an American mathematician whose calculations of orbital mechanics as a NASA employee were critical to the success of the first and subsequent U.S. crewed spaceflights. ","isCertain":false},{"name":"Kathleen Booth","url":"https://en.wikipedia.org/wiki/Kathleen_Booth","summary":"Kathleen Booth wrote the first assembly language and designed the assembler and autocode for the first computer systems at Birkbeck College, University of London. She helped design three different machines including the ARC, SEC, and APE(X)C.","isCertain":true},{"name":"Klara Dan von Neumann","url":"https://en.wikipedia.org/wiki/Klara_Dan_von_Neumann","summary":"Klára Dán von Neumann was a Hungarian-American computer scientist, noted as one of the first computer programmers.","isCertain":false},{"name":"List of queens regnant","url":"https://en.wikipedia.org/wiki/Elizabeth_II","summary":"Elizabeth II is Queen of the United Kingdom and the other Commonwealth realms.\nElizabeth was born in London as the first child of the Duke and Duchess of York, later King George VI and Queen Elizabeth, and she was educated privately at home. ","isCertain":true},{"name":"Lixia Zhang","url":"https://en.wikipedia.org/wiki/Lixia_Zhang","summary":"Lixia Zhang is the Jonathan B. Postel Professor of Computer Science at the University of California, Los Angeles. Her expertise is in computer networks; she helped found the Internet Engineering Task Force, designed the Resource Reservation Protocol, coined the term \"middlebox\", and pioneered the development of named data networking.","isCertain":true},{"name":"Lucy Sanders","url":"https://en.wikipedia.org/wiki/Lucy_Sanders","summary":"Lucinda \"Lucy\" Sanders is the current CEO and a co-founder of the National Center for Women &amp; Information Technology. She is the recipient of many distinguished honors in the STEM fields, including induction into the US News STEM Leadership Hall of Fame in 2013.","isCertain":true},{"name":"Margaret Hamilton (scientist)","url":"https://en.wikipedia.org/wiki/Margaret_Hamilton_(software_engineer)","summary":"Margaret Heafield Hamilton is an American computer scientist, systems engineer and business owner. She was director of the Software Engineering Division of the MIT Instrumentation Laboratory, which developed on-board flight software for NASA's Apollo space program. ","isCertain":true},{"name":"Margot Lee Shetterly","url":"https://en.wikipedia.org/wiki/Margot_Lee_Shetterly","summary":"Margot Lee Shetterly is an American non-fiction writer who has also worked in investment banking and media startups. Her first book, Hidden Figures: The Story of the African-American Women Who Helped Win the Space Race, is about African-American women mathematicians working at NASA who were instrumental to the success of the United States space program. ","isCertain":true},{"name":"Mary K. Hawes","url":"https://en.wikipedia.org/wiki/Mary_K._Hawes","summary":"Mary K. Hawes was a computer scientist who identified the need for a common business language in accounting, which led to the development of COBOL. COBOL is short for Common Business Oriented Language. It was written to resemble ordinary English. ","isCertain":false},{"name":"Mary Lou Jepsen","url":"https://en.wikipedia.org/wiki/Mary_Lou_Jepsen","summary":"Mary Lou Jepsen is a technical executive and inventor in the fields of display, imaging, and computer hardware. Her contributions have had worldwide adoption in head-mounted display, HDTV, laptop computers, and projector products; she was the technical force behind a generation of low-cost computing, and innovative consumer and medical imaging technologies. ","isCertain":true},{"name":"Michelle Simmons","url":"https://en.wikipedia.org/wiki/Michelle_Simmons","summary":"Michelle Yvonne Simmons, AO FRS FAA FRSN FTSE is a Scientia Professor of Quantum Physics in the Faculty of Science at the University of New South Wales and has twice been an Australian Research Council Federation Fellow and is an Australian Research Council Laureate Fellow. ","isCertain":false},{"name":"Mirella Lapata","url":"https://en.wikipedia.org/wiki/Mirella_Lapata","summary":"Mirella Lapata FRSE is a computer scientist and Professor in the School of Informatics at the University of Edinburgh. Working on the general problem of extracting semantic information from large bodies of text, Lapata develops computer algorithms and models in the field of natural language processing.","isCertain":false},{"name":"Nadia Magnenat Thalmann","url":"https://en.wikipedia.org/wiki/Nadia_Magnenat_Thalmann","summary":"Professor Nadia Magnenat Thalmann is an eminent computer graphics scientist and robotician and is the founder and head of MIRALab at the University of Geneva. ","isCertain":false},{"name":"Nancy Hafkin","url":"https://en.wikipedia.org/wiki/Nancy_Hafkin","summary":"Nancy Hafkin is a pioneer of networking and development information and electronic communications in Africa, spurring the Pan African Development Information System of the United Nations Economic Commission for Africa from 1987 until 1997. ","isCertain":false},{"name":"Nicole-Reine Lepaute","url":"https://en.wikipedia.org/wiki/Nicole-Reine_Lepaute","summary":"Nicole-Reine Lepaute, was a French astronomer and mathematician. Lepaute predicted the return of Halley's Comet by calculating the timing of a solar eclipse and constructing a group of catalogs for the stars.\n","isCertain":false},{"name":"Pamela Hardt-English","url":"https://en.wikipedia.org/wiki/Pamela_Hardt-English","summary":"Pamela Hardt-English is an American food scientist and computer scientist who created Resource One, a people's computing center in 1972 at Project One, a \"technological commune\" in San Francisco, California.","isCertain":false},{"name":"Roberta Williams","url":"https://en.wikipedia.org/wiki/Roberta_Williams","summary":"Roberta Williams is an American video game designer, writer, and a co-founder of Sierra On-Line, who developed her first game while living in Simi Valley, California. ","isCertain":true},{"name":"Rosemary Candlin","url":"https://en.wikipedia.org/wiki/Rosemary_Candlin","summary":"Rosemary Candlin is a crystalographer and computer scientist who joined the University of Edinburgh Computer Science Department shortly after it was first established, and for some time was the only woman lecturer on the staff. ","isCertain":false},{"name":"Stacy Horn","url":"https://en.wikipedia.org/wiki/Stacy_Horn","summary":"Stacy Horn is an American author, businesswoman and occasional journalist. She grew up on Long Island, New York and received a B.F.A. from Tufts University and the School of the Museum of Fine Arts. ","isCertain":true},{"name":"Susan Kare","url":"https://en.wikipedia.org/wiki/Susan_Kare","summary":"Susan Kare is an artist and graphic designer best known for her interface elements and typeface contributions to the first Apple Macintosh in the 1980s. ","isCertain":true},{"name":"Wendy Hall","url":"https://en.wikipedia.org/wiki/Wendy_Hall","summary":"Dame Wendy Hall, DBE, FRS, FREng is a British computer scientist. She is Regius Professor of Computer Science at the University of Southampton.","isCertain":true},{"name":"Women in Italy","url":"https://en.wikipedia.org/wiki/Jes%C3%BAs_Franco","summary":"Jesús Franco was a Spanish filmmaker, composer, and actor, best known for his stylish exploitation films, directing around 160 feature films.","isCertain":false}]